import { Game } from "./components/game.js";
const menuEl = document.getElementById('menu');
const playBtn = document.querySelector('.menu__start-btn');


playBtn.addEventListener('click',()=>startGame());


async function startGame(){
    menuEl.style.opacity = 0;
    setTimeout(()=>{
        menuEl.style.display = 'none';
        const game = new Game(randomWord());
    },800);
    

}
function randomWord(){
const words = [
  // Животные
  "кот", "пес", "бык", "лев", "сова", "рыба", "лось", "коза", "осел", "енот",
  "бобр", "крот", "хомяк", "сурок", "тюлень", "волк", "заяц", "рысь", "соболь", "кит",
  "ягуар", "зебра", "жираф", "белка", "выдра",
  
  // Предметы
  "стол", "стул", "дверь", "окно", "часы", "книга", "ручка", "нож", "вилка", "ложка",
  "тарелка", "чашка", "кружка", "ваза", "лампа", "ключ", "замок", "чемодан", "зонт", "шарф",
  "шапка", "носок", "ботинок", "ремень", "очки", "зеркало", "щетка", "мыло", "полотенце", "кровать",
  "шкаф", "полка", "ковер", "картина", "гитара", "скрипка", "барабан", "мяч", "кубик", "пазл",
  "карандаш", "линейка", "ластик", "пенал", "тетрадь", "дневник", "альбом", "фото", "карта", "флаг",
  
  // Здания и сооружения
  "дом", "сарай", "гараж", "баня", "дача", "изба", "хата", "хижина", "замок", "дворец",
  "храм", "церковь", "мечеть", "собор", "костел", "палата", "казарма", "тюрьма", "штаб", "офис",
  "магазин", "рынок", "склад", "ангар", "цех", "завод", "фабрика", "музей", "театр", "кино",
  "кафе", "бар", "ресторан", "столовая", "библиотека", "школа", "лицей", "колледж", "институт", "аэропорт",
  "вокзал", "порт", "стадион", "бассейн", "больница", "поликлиника", "аптека", "гостиница", "мотель", "кемпинг"
];

    let id = Math.floor(Math.random()*(words.length+1));
    return words[id];
}